Revit 2016 API
FabricationRodInfo Methods
The FabricationRodInfo type exposes the following members.
Methods
Name | Description
AttachToStructure
 Attaches to the nearest structural element.
Dispose
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetRodAttachedElementId
 Gets the id of the attached component for the specified rod.
GetRodEndPosition
 Gets the position of the rod end.
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
FabricationRodInfo Class
Autodesk.Revit.DB Namespace